# Missing values

In [9]:
import pandas
import numpy
data_src={'first_name':['abhilash',None,'gungun','shivam','ravi'],'last_name':['pratap','singh','rana',numpy.nan,'NA'],'age':[27,28,18,20,30]}
df=pandas.DataFrame(data_src,)
df

  first_name last_name  age
0   abhilash    pratap   27
1       None     singh   28
2     gungun      rana   18
3     shivam       NaN   20
4       ravi        na   30

In [10]:
# How to Delete all rows which contain 'nan' and "none' value
df.dropna()

  first_name last_name  age
0   abhilash    pratap   27
2     gungun      rana   18
4       ravi        na   30

In [ ]:
df.dropna(axis='index',how='any') #----> this method drop those rows  which contain any nan or none values 
df.dropna(axis='index',how='all') #----> this method drop those row which contain all nan or none values
df.dropna(axis='columns',how='any')#----> this method columns those row which contain all nan or none values
df.dropna(axis='columns',how='all')#----> this method columns those row which contain all nan or none values

In [13]:
# Replace na and none value with other values
df.replace('na',numpy.nan)
df

  first_name last_name  age
0   abhilash    pratap   27
1       None     singh   28
2     gungun      rana   18
3     shivam       NaN   20
4       ravi        na   30

In [15]:
# How to check which contains nan values: by isna() methods which return boolean values
df.isna()

   first_name  last_name    age
0       False      False  False
1        True      False  False
2       False      False  False
3       False       True  False
4       False      False  False

In [16]:
# How to replace na values with other string
df.fillna('Missing')

  first_name last_name  age
0   abhilash    pratap   27
1    Missing     singh   28
2     gungun      rana   18
3     shivam   Missing   20
4       ravi        na   30

## casting datatype

In [20]:
df['age'].replace(27,numpy.nan,inplace=True)
df

  first_name last_name   age
0   abhilash    pratap   NaN
1       None     singh  28.0
2     gungun      rana  18.0
3     shivam       NaN  20.0
4       ravi        na  30.0

In [26]:
df['age'].astype('object')

0     NaN
1    28.0
2    18.0
3    20.0
4    30.0
Name: age, dtype: object

In [28]:
#how to find unique values
df['age'].unique
df['age']

0     NaN
1    28.0
2    18.0
3    20.0
4    30.0
Name: age, dtype: float64